{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "21 Август и Беатриса играют в игру. Август загадал натуральное число от `1` до `n`. Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе `YES`, если среди названных ей чисел есть задуманное или `NO` в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.\n",
    "\n",
    "В первой строке задано `n` - максимальное число, которое мог загадать Август. Далее каждая строка содержит вопрос Беатрисы (множество чисел, разделенных пробелом) и ответ Августа на этот вопрос.\n",
    "\n",
    "Вы должны вывести через пробел, в порядке возрастания, все числа, которые мог задумать Август.\n",
    "\n",
    "**Входные данные**\n",
    "```\n",
    "10\n",
    "1 2 3 4 5\n",
    "YES\n",
    "2 4 6 8 10\n",
    "NO\n",
    "HELP\n",
    "```\n",
    "\n",
    "**Выходные данные**\n",
    "```\n",
    "1 3 5\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}\n",
      "1 2 3 4 5\n",
      "{1, 2, 3, 4, 5}\n",
      "2 4 6 8 10\n",
      "{1, 3, 5}\n",
      "1 3 5\n"
     ]
    }
   ],
   "source": [
    "it = iter(\n",
    "    \"\"\"10\n",
    "1 2 3 4 5\n",
    "YES\n",
    "2 4 6 8 10\n",
    "NO\n",
    "HELP\n",
    "\"\"\".splitlines()\n",
    ")\n",
    "input = lambda: next(it)\n",
    "\n",
    "\n",
    "n = int(input())\n",
    "ans = set(range(1, n + 1))\n",
    "# print(ans)\n",
    "\n",
    "s = input()\n",
    "while s != \"HELP\":\n",
    "    # print(s)\n",
    "    s = set(map(int, s.split()))\n",
    "    if input() == \"YES\":\n",
    "        ans &= s\n",
    "    else:\n",
    "        ans -= s\n",
    "    # print(ans)\n",
    "    s = input()\n",
    "\n",
    "print(*sorted(ans))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Август и Беатриса играют в игру. Август загадал натуральное число от `1` до `n`. Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе `YES`, если среди названных ей чисел есть задуманное или `NO` в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.\n",
    "\n",
    "Август начал жульничать. На каждый из вопросов Беатрисы он выбирает такой вариант ответа `YES` или `NO`, чтобы множество возможных задуманных чисел оставалось как можно больше. Например, если Август задумал число от 1 до 5, а Беатриса спросила про числа 1 и 2, то Август ответит `NO`, а если Беатриса спросит про 1, 2, 3, то Август ответит `YES`.\n",
    "\n",
    "Если же Беатриса в своем вопросе перечисляет ровно половину из задуманных чисел, то Август из вредности всегда отвечает `NO`. Наконец, Август при ответе учитывает все предыдущие вопросы Беатрисы и свои ответы на них, то есть множество возможных задуманных чисел уменьшается.\n",
    "\n",
    "Первая строка содержит наибольшее число, которое мог загадать Август. Каждая следующая строка содержит очередной вопрос Беатрисы: набор чисел, разделенных пробелами. Последняя строка входных данных содержит одно слово `HELP`.\n",
    "\n",
    "Для каждого вопроса Беатрисы выведите ответ Августа на этот вопрос. После этого выведите через пробел, в порядке возрастания, все числа, которые мог загадать Август после ответа на все вопросы Беатрисы.\n",
    "\n",
    "**Входные данные**\n",
    "```\n",
    "10\n",
    "1 2 3 4 5\n",
    "2 4 6 8 10\n",
    "HELP\n",
    "```\n",
    "**Выходные данные**\n",
    "```\n",
    "NO\n",
    "YES\n",
    "6 8 10\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}\n",
      "1 2 3 4 5\n",
      "NO\n",
      "{6, 7, 8, 9, 10}\n",
      "2 4 6 8 10\n",
      "YES\n",
      "{8, 10, 6}\n",
      "6 8 10\n"
     ]
    }
   ],
   "source": [
    "it = iter(\n",
    "    \"\"\"10\n",
    "1 2 3 4 5\n",
    "2 4 6 8 10\n",
    "HELP\n",
    "\"\"\".splitlines()\n",
    ")\n",
    "\n",
    "n = int(input())\n",
    "ans = set(range(1, n + 1))\n",
    "print(ans)\n",
    "\n",
    "s = input()\n",
    "while s != \"HELP\":\n",
    "    print(s)\n",
    "    s = set(map(int, s.split()))\n",
    "\n",
    "    if len(ans & s) > len(ans - s):\n",
    "        print(\"YES\")\n",
    "        ans &= s\n",
    "    else:\n",
    "        print(\"NO\")\n",
    "        ans -= s\n",
    "\n",
    "    print(ans)\n",
    "    s = input()\n",
    "\n",
    "print(*sorted(ans))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "19 Аня и Боря любят играть в разноцветные кубики, причем у каждого из них свой набор и в каждом наборе все кубики различны по цвету. Однажды дети заинтересовались, сколько существуют цветов таких, что кубики каждого цвета присутствуют в обоих наборах. Для этого они занумеровали все цвета случайными числами от 0 до 108. На этом их энтузиазм иссяк, поэтому вам предлагается помочь им в оставшейся части.\n",
    "\n",
    "В первой строке входных данных записаны числа N и M — число кубиков у Ани и Бори. В следующих N строках заданы номера цветов кубиков Ани. В последних M строках номера цветов Бори.\n",
    "\n",
    "Найдите три множества: номера цветов кубиков, которые есть в обоих наборах; номера цветов кубиков, которые есть только у Ани и номера цветов кубиков, которые есть только у Бори. Для каждого из множеств выведите сначала количество элементов в нем, а затем сами элементы, отсортированные по возрастанию.\n",
    "\n",
    "**Входные данные**\n",
    "```\n",
    "4 3\n",
    "0\n",
    "1\n",
    "10\n",
    "9\n",
    "1\n",
    "3\n",
    "0\n",
    "```\n",
    "**Выходные данные**\n",
    "```\n",
    "2\n",
    "0 1\n",
    "2\n",
    "9 10\n",
    "1\n",
    "3\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{0, 1, 10, 9}\n",
      "{0, 1, 3}\n",
      "2\n",
      "0 1\n",
      "2\n",
      "9 10\n",
      "1\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "it = iter(\"\"\"4 3\n",
    "0\n",
    "1\n",
    "10\n",
    "9\n",
    "1\n",
    "3\n",
    "0\"\"\".splitlines())\n",
    "\n",
    "def read_cubes(n):\n",
    "    res = set()\n",
    "    for _ in range(n):\n",
    "        res.add(int(input()))\n",
    "    return res\n",
    "\n",
    "n, m = map(int, input().split())\n",
    "# a = read_cubes(n)\n",
    "a = set()\n",
    "for _ in range(n):\n",
    "    a.add(int(input()))\n",
    "print(a)\n",
    "# b = read_cubes(m)\n",
    "b = set()\n",
    "for _ in range(m):\n",
    "    b.add(int(input()))\n",
    "print(b)\n",
    "\n",
    "print(len(a & b))\n",
    "print(*sorted(a & b))\n",
    "\n",
    "print(len(a - b))\n",
    "print(*sorted(a - b))\n",
    "\n",
    "print(len(b - a))\n",
    "print(*sorted(b - a))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
